import math

# Входные данные
n1 = 37
n2 = 41
N1 = 153
N2 = 221 
n2_crit = 3
# Коэффициент Страуда -- кол-во элементарных различений в секунду
S = 10

# Рассчеты
n = n1 + n2
N = N1 + N2
N_theor = n1 * math.log(n1, 2) + n2 * math.log(n2, 2)
N_delta = abs(N - N_theor) * 100 / N
print("===================================================")
print("Словарь программы                     n = ", n)
print("Длина программы                       N = ", N)
print("Теоретическая длина программы   N_theor = ", N_theor)
print("---------------------------------------------------")
print("Разница в пределах 15%?", (N_delta <= 15))
print("===================================================")

V = N * math.log(n, 2)
V_pot = (2 + n2_crit) * math.log((2 + n2_crit), 2)
print("Объем программы                       V = ", V)
print("Потенциальный объем программы        V* = ", V_pot)
print("===================================================")

L = V_pot / V
L_t = (2 * n2) / (n1 * N2)
I  = L_t * V
print("Уровень программы                     L = ", L)
print("Интеллектуальное содержание программы I = ", I)
print("===================================================")

E = V / L
T = E / S #(n1 * N2 * N * math.log2(n)) / (2 * S * n2) ???
print("Работа программиста                   E = ", E)
print("Теоретическое время разработки        T = ", T)
print("===================================================")

PLevel_lambda = L * V_pot
B_errors = math.ceil(V_pot ** 2 / (1000 * PLevel_lambda))
print("Уровень языка                         λ = ", PLevel_lambda)
print("( λ_pascal ~ λ_c = 0.01 -- 0.1 | λ_asm =  λ_c * (~3))")
print("Число первоначальных ошибок           B = ", B_errors)
print("===================================================")
